In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

# 문제 1 (10점)

구구단 9단을 짝수번째만 출력하시오.

<답안 예시>

9x2=18
9x4=36
9x6=54
9x8=72

In [10]:
for i in range(2,9,2):
    print("9X"+str(i)+"="+str(9*i))

9X2=18
9X4=36
9X6=54
9X8=72

# 문제 2

다음 데이터를 사용하여 각 문항에 답하시오.

In [2]:
iris=sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 문제 [2-1] (10점)

iris의 species 열 값 분포를 확인하시오.

In [3]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

### 문제 [2-2] (10점)

species 별로 각 변수의 최댓값을 구하시오.

In [ ]:
iris['spices'].g

### 문제 [2-3] (10점)

iris의 species 열 값을 setosa는 1, 그 외의 값들은 0으로 변환하시오. 
(apply, lambda 사용)

# 문제 3

다음 데이터에 사용하여 각 문항에 따라 답하시오.

In [3]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 문제 [3-1] (10점)

titanic에서 pclass, age, sibsp, fare, class 열만 뽑아 df에 저장하시오.

### 문제 [3-2] (5점)

df의 열 별 결측치 개수를 구하시오.

### 문제 [3-3] (10점)

df에 결측치가 있다면, 해당 열의 평균값으로 채우시오.

### 문제 [3-4] (5점)

survived.csv를 불러와 survived에 저장하시오.

### 문제 [3-5] (10점)

기존에 생성한 df와 survived 데이터프레임을 병합해 df2에 저장하시오.

### 문제 [3-6] (20점)

df2 데이터에서 각 class 별 생존율을 구하시오.